# CreatePushButton

## Description
Creates a new push button control in a dialog layout.

```pascal
PROCEDURE CreatePushButton(
				dialogID : LONGINT;
				itemID   : LONGINT;
				text     : STRING);
```

```python

def vs.CreatePushButton(dialogID, itemID, text):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The index of the dialog layout containing the control.|
|itemID|LONGINT|The index that will identify the control item.|
|text|STRING|The display text for the control.|

## Remarks
[DWD 1/20/00]

## Version
Availability: from VectorWorks9.0
## Category
* Dialogs - Modern